console.log("Немного информации для проверяющих по особенностям работы приложения и выполненным пунктам. \nОгромная просьба прочитать все в ходе проверки, что бы не возникло спорных ситуаций.");
console.log("1. Часы и календарь +15 \n - Все пункты реализованы в полном объеме. \n - !!! Иногда, при неполной загрузке стилей, верстка дергается в процессе обновления времени. Перезагрузка страницы решает проблему.");
console.log("2. Приветствие +10 \n - Все пункты реализованы в полном объеме в т.ч. те, что не проверяются в хоте сросс-чека.");
console.log("3. Смена фонового изображения \n - Все пункты реализованы в полном объеме. \n - !!! Изображения не оптимизированы, в зависимости от скорости инета, при проверке могут загружаться не быстро, \n создавая впечатление не  реализованной функции");
console.log("4. Виджет погоды +15 \n - Все пункты реализованы в полном объеме. \n - При вводе заведомо неправильного города, получаем ошибку. Для обновления данных погоды из состояния ошибки, страницу нужно обновить. Связано с особенностями верстки макета");
console.log("5. Виджет цитата дня +10 \n - Все пункты реализованы в полном объеме.");
console.log("6. Аудиоплеер +15 \n - Все пункты реализованы в полном объеме.");
console.log("7. Продвинутый аудиоплеер (реализуется без использования библиотек) +20 \n - Все пункты реализованы в полном объеме. \n - Треки не обрезал, проверку переключения можно проверить перемотав трек до конца. \n - При очень быстром переключении треков, иногда возникает ошибка загрузки (видно в консоли), лечится перезагрузкой приложения.");
console.log("8. Перевод приложения на два языка (en/ru или en/be) +15  \n - Все пункты реализованы в полном объеме. \n - Перевод основан на локальных файлах без библиотек и пр.");
console.log("9. Получение фонового изображения от API +10  \n - Все пункты реализованы в полном объеме. \n - !!! Тег для API по умолчанию равен времени суток. Заметил такую особенность, иногда сервер не возвращает изображения, лечится перезагрузкой страницы. \n - !!! С некоторыми тегами возможны ошибки в получении данных. \n - !!! Для проверки применения тегов залогировал в консоль ссылку JSON API.");
console.log("10. Настройки приложения +20  \n - Все пункты реализованы в полном объеме.");
console.log("11. Дополнительный функционал на выбор + 0  \n - Пункт не реализован. К сожалению, нехватка времени...");
console.log("\n ИТОГ: 150/160. В случае обнаружения каких либо критических замечаний в ходе проверки, просьба связаться со мной в дискорд Viruss#6122 или Sergei-6@bk.ru. Спасибо!");
console.log("\n -------------------------------------------------------------");




















